jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS_CAL_3X3_SAFE/Core/Src/system_control.c
#include "system_control.h"
#include "vision_config.h"
#include "main.h"
#include "stm32f4xx_hal.h"

/*
 * Vision MVP control policy
 * -------------------------
 * One RTOS task owns Motion_X, Motion_Y and System_Task in deterministic order.
 * This file owns the one-shot laboratory start/Home/camera-ready sequence.
 * OpenCV/PC integration will attach AFTER SYS_CAMERA_READY through a command
 * interface; it must not directly manipulate MotionController_t state.
 */

/* KEY0: released=PE4 high, pressed=PE4 low. Return 1 while pressed. */
static uint8_t Read_Key0(void)
{
    return (HAL_GPIO_ReadPin(
                KEY0_GPIO_Port,
                KEY0_Pin) == GPIO_PIN_RESET) ? 1U : 0U;
}

/* Existing Home sensor convention confirmed by the current project. */
static uint8_t X_HomeTriggered(void)
{
    return (HAL_GPIO_ReadPin(
                X_HOME_GPIO_Port,
                X_HOME_Pin) == GPIO_PIN_SET) ? 1U : 0U;
}

static uint8_t Y_HomeTriggered(void)
{
    return (HAL_GPIO_ReadPin(
                Y_HOME_GPIO_Port,
                Y_HOME_Pin) == GPIO_PIN_SET) ? 1U : 0U;
}

/* Confirmed real-machine Home directions. */
#define X_HOME_DIR_SIGN   (+1)
#define Y_HOME_DIR_SIGN   (+1)

/* Home motion parameters: intentionally frozen during Vision MVP bring-up. */
#define HOME_FAST_STEP            512
#define HOME_FAST_SPEED           350U
#define HOME_FAST_ACCEL           1U

#define HOME_BACK_STEP            512
#define HOME_BACK_SPEED           150U
#define HOME_BACK_ACCEL           1U

#define HOME_SLOW_STEP            64
#define HOME_SLOW_SPEED           80U
#define HOME_SLOW_ACCEL           1U

/*
 * "Retries" are additional attempts after the first BACK move.
 * Therefore the present maximum release travel is:
 *   (1 initial + 6 retries) * 512 = 3584 counts.
 */
#define HOME_BACK_MAX_RETRIES     6U
#define HOME_AXIS_TIMEOUT_MS      180000U
#define HOME_INTER_MOVE_MS         50U
#define HOME_STABLE_CONFIRM_MS    500U

/*
 * Final closeout filter for PG6/PG7.
 * A Home level is accepted only after remaining unchanged for 30 ms.
 */
#define HOME_SENSOR_DEBOUNCE_MS      30U

#define HOME_RELEASE_STEP         2048
#define HOME_RELEASE_SPEED        150U
#define HOME_RELEASE_ACCEL        1U

/*
 * RELEASE is also an "exit the Home sensor" phase. Give it bounded retries
 * instead of waiting motionless for HOME_AXIS_TIMEOUT_MS if 2048 counts was
 * not enough. One retry gives 2 * 2048 = 4096 counts, already greater
 * than the complete 3584-count BACK span while avoiding an unnecessary
 * third release move.
 */
#define HOME_RELEASE_MAX_RETRIES     1U

/* Enable frames are retried on HAL_BUSY, but startup may not hang forever. */
#define CONTROL_ENABLE_TX_TIMEOUT_MS  1500U

static AxisHomeCtx_t home_x;
static AxisHomeCtx_t home_y;

volatile SystemState_t system_state = SYS_STARTUP;
static uint32_t system_state_tick = 0U;

/*
 * Build marker for Keil Watch.
 * 0x2609133A = V5.5 SAFE 3x3 affine-calibration tool.
 */
volatile uint32_t g_build_id = 0x2609133AU;
volatile uint8_t g_key0_level = 0U;
volatile uint32_t g_key0_hold_ms = 0U;
volatile uint32_t g_key0_start_count = 0U;
volatile uint8_t g_camera_ready = 0U;
volatile uint8_t g_debug_home_request = 0U;
volatile uint8_t g_camera_move_request = 0U;
/* Debug/vision request: take another picture without moving X/Y. */
volatile uint8_t g_camera_trigger_request = 0U;

volatile SystemState_t g_system_error_from_state = SYS_STARTUP;
volatile HomeStage_t g_home_x_stage = HOME_STAGE_FAST_START;
volatile HomeStage_t g_home_y_stage = HOME_STAGE_FAST_START;

volatile uint8_t g_camera_ready_y_enable = CAMERA_READY_Y_ENABLE_DEFAULT;
volatile int64_t g_camera_ready_x_target = CAMERA_READY_X_DEFAULT;
volatile int64_t g_camera_ready_y_target = CAMERA_READY_Y_DEFAULT;
volatile int64_t g_camera_ready_x_actual = 0;
volatile int64_t g_camera_ready_y_actual = 0;

/*
 * SAFE 3x3 capture order.
 *
 * The previous formal run showed all X=79920 points were grossly abnormal,
 * while X=96304 and X=112688 produced a stable local mapping after arrival.
 * Therefore this closeout grid stays inside that proven X region:
 *
 *   X = 96304, 104496, 112688        (8192-count spacing)
 *   Y = 20480, 36864, 53248          (16384-count spacing)
 *
 * Continuous serpentine path:
 *
 *   P6 ---- P7 ---- P8
 *   |               |
 *   P5 ---- P4 ---- P3
 *   |               |
 *   P0 ---- P1 ---- P2
 *
 * P0 is the first CameraReady capture after the single Home sequence.
 * Every following point is exactly one grid step away from the previous one.
 */
static const int8_t cal_grid_x[CAL_3X3_POINT_COUNT] =
{
     0,  1,  2,  2,  1,  0,  0,  1,  2
};

static const int8_t cal_grid_y[CAL_3X3_POINT_COUNT] =
{
    -1, -1, -1,  0,  0,  0,  1,  1,  1
};

volatile uint8_t g_cal_point_index = 0U;
volatile uint8_t g_cal_capture_count = 0U;
volatile uint8_t g_cal_sequence_done = 0U;
volatile int64_t g_cal_current_x = CAMERA_READY_X_DEFAULT;
volatile int64_t g_cal_current_y = CAMERA_READY_Y_DEFAULT;

/* A physical KEY0 release is required between calibration advances. */
static uint8_t cal_key_release_required = 0U;

/* KEY0 level/hold tracking used by Home start and calibration advance. */
static uint8_t key0_hold_active = 0U;
static uint32_t key0_hold_start_tick = 0U;

/*
 * One-shot start authorization.
 *
 * We deliberately do NOT use a press-edge event here.  The previous project
 * spent too much time on a laboratory button that is not part of the future
 * OpenCV motion path.  A stable physical press for KEY0_START_HOLD_MS is enough
 * to authorize the single Home sequence for this boot.
 */
static uint8_t Key0_HoldStartRequested(void)
{
    uint32_t now = HAL_GetTick();
    uint8_t pressed = Read_Key0();

    g_key0_level = pressed;

    if (pressed == 0U)
    {
        key0_hold_active = 0U;
        key0_hold_start_tick = 0U;
        g_key0_hold_ms = 0U;
        return 0U;
    }

    if (key0_hold_active == 0U)
    {
        key0_hold_active = 1U;
        key0_hold_start_tick = now;
        g_key0_hold_ms = 0U;
        return 0U;
    }

