jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS_CAL_3X3_SAFE/Core/Src/system_control.c
    g_key0_hold_ms = now - key0_hold_start_tick;

    if (g_key0_hold_ms >= KEY0_START_HOLD_MS)
    {
        g_key0_start_count++;
        return 1U;
    }

    return 0U;
}

static void Key0_ResetHold(void)
{
    key0_hold_active = 0U;
    key0_hold_start_tick = 0U;
    g_key0_hold_ms = 0U;
    g_key0_level = Read_Key0();
}


/*
 * Use KEY0 as a one-shot "advance to next calibration point" command.
 * The press that started Home is never allowed to carry through into P1.
 */
static uint8_t Cal_KeyAdvanceRequested(void)
{
    if (CAL_3X3_ENABLE == 0U)
    {
        return 0U;
    }

    if (cal_key_release_required != 0U)
    {
        if (Read_Key0() == 0U)
        {
            cal_key_release_required = 0U;
            Key0_ResetHold();
        }

        return 0U;
    }

    if (Key0_HoldStartRequested() != 0U)
    {
        cal_key_release_required = 1U;
        Key0_ResetHold();
        return 1U;
    }

    return 0U;
}


static void Cal_LoadPoint(uint8_t point_index)
{
    int64_t x;
    int64_t y;

    x = CAMERA_READY_X_DEFAULT +
        ((int64_t)cal_grid_x[point_index] * CAL_3X3_X_STEP_COUNTS);
    y = CAMERA_READY_Y_DEFAULT +
        ((int64_t)cal_grid_y[point_index] * CAL_3X3_Y_STEP_COUNTS);

    g_camera_ready_x_target = x;
    g_camera_ready_y_target = y;
    g_camera_ready_y_enable = 1U;

    g_cal_current_x = x;
    g_cal_current_y = y;
}


/*
 * Advance from the current captured point to the next grid point.
 * Motion is still owned by the normal System/Motion state machine:
 * absolute move -> encoder verification -> 500 ms settle -> PB0 trigger.
 */
static uint8_t Cal_StartNextPoint(void)
{
    uint8_t next_point;

    if ((CAL_3X3_ENABLE == 0U) ||
        (g_cal_sequence_done != 0U))
    {
        return 0U;
    }

    next_point = (uint8_t)(g_cal_point_index + 1U);

    if (next_point >= CAL_3X3_POINT_COUNT)
    {
        return 0U;
    }

    g_cal_point_index = next_point;
    Cal_LoadPoint(g_cal_point_index);

    g_camera_ready = 0U;
    g_camera_move_request = 1U;

    return 1U;
}

static void System_EnterError(void)
{
    /*
     * SYS_ERROR is a terminal SOFTWARE state, not an emergency stop.
     *
     * - PB0 is forced back to camera-idle HIGH.
     * - Future 0x31 polling is disabled so a dead CAN link cannot immediately
     *   refill all TX mailboxes after we abort them.
     * - HAL_CAN_AbortTxRequest() is best-effort only. A frame that has already
     *   started/succeeded on the bus may still have reached the driver.
     * - A motor command already accepted by the external driver may continue
     *   to completion because the verified Stop command is still unknown.
     */
    HAL_GPIO_WritePin(
        CAMERA_TRIG_GPIO_Port,
        CAMERA_TRIG_Pin,
        GPIO_PIN_SET);

    Motion_SetPollingEnabled(home_x.motion, 0U);
    Motion_SetPollingEnabled(home_y.motion, 0U);

    (void)HAL_CAN_AbortTxRequest(
        &hcan1,
        CAN_TX_MAILBOX0 |
        CAN_TX_MAILBOX1 |
        CAN_TX_MAILBOX2);

    g_system_error_from_state = system_state;
    g_camera_ready = 0U;
    system_state = SYS_ERROR;
}

static uint8_t Camera_TargetWithin(
    MotionController_t *motion,
    int64_t target_machine,
    int64_t tolerance)
{
    int64_t error;

    /*
     * A numerically correct but stale encoder value is NOT a valid interlock.
     * Camera trigger is allowed only while position feedback is current.
     */
    if (Motion_PositionIsFresh(motion) == 0U)
    {
        return 0U;
    }

    error =
        target_machine - Motion_GetMachinePosition(motion);

    if (error < 0)
    {
        error = -error;
    }

    return (error <= tolerance) ? 1U : 0U;
}

static uint8_t Camera_TargetAlreadyReached(
    MotionController_t *motion,
    int64_t target_machine)
{
    return Camera_TargetWithin(
        motion,
        target_machine,
        CAMERA_READY_SKIP_TOLERANCE);
}

static uint8_t Camera_AllTargetsVerified(void)
{
    if (!Camera_TargetWithin(
            home_x.motion,
            g_camera_ready_x_target,
            CAMERA_READY_VERIFY_TOLERANCE))
    {
        return 0U;
    }

    if ((g_camera_ready_y_enable != 0U) &&
        !Camera_TargetWithin(
            home_y.motion,
            g_camera_ready_y_target,
            CAMERA_READY_VERIFY_TOLERANCE))
    {
        return 0U;
    }

    return 1U;
}

static void System_StartCameraSettle(void)
{
    g_camera_ready = 0U;

    /* Never let a bad mechanical position reach the camera trigger. */
    if (Camera_AllTargetsVerified() == 0U)
    {
        System_EnterError();
        return;
    }

    system_state_tick = HAL_GetTick();
    system_state = SYS_CAMERA_SETTLE;
}


static void AxisHome_Init(
    AxisHomeCtx_t *ctx,
    MotionController_t *motion,
    HomeSensorFn_t sensor,
    int32_t dir_sign)
{
    ctx->motion = motion;
    ctx->sensor_triggered = sensor;
    ctx->dir_sign = dir_sign;

    ctx->stage = HOME_STAGE_FAST_START;
    ctx->home_start_tick = HAL_GetTick();
    ctx->next_move_tick = 0U;
    ctx->stable_start_tick = 0U;
    ctx->back_retry_count = 0U;
    ctx->release_retry_count = 0U;

    /*
     * Do not trust the first GPIO sample. The same raw level must remain
     * stable for HOME_SENSOR_DEBOUNCE_MS before the first Home motion starts.
     */
    ctx->sensor_raw_last = ctx->sensor_triggered();
    ctx->sensor_debounced = 0U;
    ctx->sensor_ready = 0U;
    ctx->sensor_change_tick = HAL_GetTick();
}


static void AxisHome_UpdateSensor(AxisHomeCtx_t *ctx)
{
    uint32_t now = HAL_GetTick();
    uint8_t raw = ctx->sensor_triggered();

    if (raw != ctx->sensor_raw_last)
    {
        ctx->sensor_raw_last = raw;
        ctx->sensor_change_tick = now;
        return;
    }

    if ((now - ctx->sensor_change_tick) < HOME_SENSOR_DEBOUNCE_MS)
    {
        return;
    }

    ctx->sensor_debounced = raw;
    ctx->sensor_ready = 1U;
}


static uint8_t AxisHome_SensorActive(
    const AxisHomeCtx_t *ctx)
{
    return ((ctx->sensor_ready != 0U) &&
            (ctx->sensor_debounced != 0U)) ? 1U : 0U;
}


