jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS_CAL_3X3_SAFE/Core/Src/system_control.c
/*
 * Start a fresh complete Home sequence.
 *
 * Vision MVP uses one deliberate KEY0 authorization and one complete Home
 * sequence per boot.  Repeated Home from CAMERA_READY is intentionally removed
 * from the main path so camera bring-up cannot accidentally retrigger homing.
 */
static uint8_t System_StartHome(void)
{
    if (Motion_IsBusy(home_x.motion) ||
        Motion_IsBusy(home_y.motion))
    {
        return 0U;
    }

    AxisHome_Init(
        &home_x,
        home_x.motion,
        X_HomeTriggered,
        X_HOME_DIR_SIGN);

    AxisHome_Init(
        &home_y,
        home_y.motion,
        Y_HomeTriggered,
        Y_HOME_DIR_SIGN);

    /* The Home-start press must be released before P1 can be requested. */
    cal_key_release_required = 1U;

    system_state = SYS_HOME_X;

    return 1U;
}


static uint8_t AxisHome_Task(
    AxisHomeCtx_t *ctx)
{
    MotionResultCode_t result;

    /*
     * Sample raw Home GPIO every ControlTask cycle, including while a motor
     * chunk is moving. State transitions below see only the debounced level.
     */
    AxisHome_UpdateSensor(ctx);

    if (ctx->sensor_ready == 0U)
    {
        return 0U;
    }

    if ((HAL_GetTick() - ctx->home_start_tick) >=
        HOME_AXIS_TIMEOUT_MS)
    {
        ctx->stage = HOME_STAGE_ERROR;
    }

    switch (ctx->stage)
    {
        case HOME_STAGE_FAST_START:

            /*
             * If already on Home at the beginning of this Home sequence,
             * release the switch first.
             *
             * This is also important for repeated Home.
             */
            if (AxisHome_SensorActive(ctx))
            {
                ctx->back_retry_count = 0U;
                ctx->stage = HOME_STAGE_BACK_START;
                break;
            }

            if ((int32_t)(HAL_GetTick() -
                          ctx->next_move_tick) < 0)
            {
                break;
            }

            if (Motion_StartHomeRelative(
                    ctx->motion,
                    ctx->dir_sign * HOME_FAST_STEP,
                    HOME_FAST_SPEED,
                    HOME_FAST_ACCEL,
                    1U))
            {
                ctx->stage = HOME_STAGE_FAST_WAIT;
            }

            break;


        case HOME_STAGE_FAST_WAIT:

            if (Motion_IsBusy(ctx->motion))
            {
                break;
            }

            /*
             * During FAST/SLOW search the Home sensor is the goal.
             * If the axis stopped early, stalled, timed out, or returned
             * STOPPED exactly on the sensor, reaching the sensor still means
             * this search leg succeeded. Only when the sensor is NOT active do
             * we interpret a non-OK Motion result as a real failure.
             *
             * BACK/RELEASE deliberately do NOT use this rule because those
             * phases are trying to leave the sensor.
             */
            if (AxisHome_SensorActive(ctx))
            {
                ctx->back_retry_count = 0U;
                ctx->next_move_tick =
                    HAL_GetTick() + HOME_INTER_MOVE_MS;
                ctx->stage = HOME_STAGE_BACK_START;
                break;
            }

            result = Motion_GetResult(ctx->motion);

            if (result != MOTION_RESULT_OK)
            {
                ctx->stage = HOME_STAGE_ERROR;
                break;
            }

            ctx->next_move_tick =
                HAL_GetTick() + HOME_INTER_MOVE_MS;
            ctx->stage = HOME_STAGE_FAST_START;
            break;


        case HOME_STAGE_BACK_START:

            if ((int32_t)(HAL_GetTick() -
                          ctx->next_move_tick) < 0)
            {
                break;
            }

            if (Motion_StartHomeRelative(
                    ctx->motion,
                    -ctx->dir_sign * HOME_BACK_STEP,
                    HOME_BACK_SPEED,
                    HOME_BACK_ACCEL,
                    0U))
            {
                ctx->stage = HOME_STAGE_BACK_WAIT;
            }

            break;


        case HOME_STAGE_BACK_WAIT:

            if (Motion_IsBusy(ctx->motion))
            {
                break;
            }

            result = Motion_GetResult(ctx->motion);

            if (result != MOTION_RESULT_OK)
            {
                ctx->stage = HOME_STAGE_ERROR;
                break;
            }

            ctx->next_move_tick =
                HAL_GetTick() + HOME_INTER_MOVE_MS;

            if (AxisHome_SensorActive(ctx))
            {
                ctx->back_retry_count++;

                if (ctx->back_retry_count >
                    HOME_BACK_MAX_RETRIES)
                {
                    ctx->stage = HOME_STAGE_ERROR;
                }
                else
                {
                    ctx->stage = HOME_STAGE_BACK_START;
                }
            }
            else
            {
                ctx->back_retry_count = 0U;
                ctx->stage = HOME_STAGE_SLOW_START;
            }

            break;


        case HOME_STAGE_SLOW_START:

            /*
             * If the sensor became active again before the slow approach
             * starts, release it again.
             */
            if (AxisHome_SensorActive(ctx))
            {
                ctx->stage = HOME_STAGE_BACK_START;
                break;
            }

            if ((int32_t)(HAL_GetTick() -
                          ctx->next_move_tick) < 0)
            {
                break;
            }

            if (Motion_StartHomeRelative(
                    ctx->motion,
                    ctx->dir_sign * HOME_SLOW_STEP,
                    HOME_SLOW_SPEED,
                    HOME_SLOW_ACCEL,
                    1U))
            {
                ctx->stage = HOME_STAGE_SLOW_WAIT;
            }

            break;


        case HOME_STAGE_SLOW_WAIT:

            if (Motion_IsBusy(ctx->motion))
            {
                break;
            }

            /*
             * Sensor-first semantics are intentional only for the two search
             * legs. Reaching Home is the successful outcome, even if the
             * Motion layer classified the way the motor stopped as STALL,
             * TIMEOUT or STOPPED.
             */
            if (AxisHome_SensorActive(ctx))
            {
                ctx->stable_start_tick = HAL_GetTick();
                ctx->stage = HOME_STAGE_STABLE_CONFIRM;
                break;
            }

