jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS_CAL_3X3_SAFE/Core/Src/system_control.c
            result = Motion_GetResult(ctx->motion);

            if (result != MOTION_RESULT_OK)
            {
                ctx->stage = HOME_STAGE_ERROR;
                break;
            }

            ctx->next_move_tick =
                HAL_GetTick() + HOME_INTER_MOVE_MS;
            ctx->stage = HOME_STAGE_SLOW_START;
            break;


        case HOME_STAGE_STABLE_CONFIRM:

            if (AxisHome_SensorActive(ctx))
            {
                if ((HAL_GetTick() -
                     ctx->stable_start_tick) >=
                    HOME_STABLE_CONFIRM_MS)
                {
                    /*
                     * Mechanical Home reference is confirmed here.
                     * Repeated Home will establish a new home_offset here.
                     */
                    if (Motion_SetZero(ctx->motion) == 0U)
                    {
                        /*
                         * Never continue Home with an invalid or stale zero.
                         * A bad home_offset would shift the entire machine
                         * coordinate system while still looking self-consistent.
                         */
                        ctx->stage = HOME_STAGE_ERROR;
                        break;
                    }

                    ctx->release_retry_count = 0U;

                    ctx->next_move_tick =
                        HAL_GetTick() + HOME_INTER_MOVE_MS;

                    ctx->stage =
                        HOME_STAGE_RELEASE_START;
                }
            }
            else
            {
                /*
                 * Home signal disappeared before the confirmation time.
                 * Treat it as unstable and approach slowly again.
                 */
                ctx->stable_start_tick = 0U;

                ctx->next_move_tick =
                    HAL_GetTick() + HOME_INTER_MOVE_MS;

                ctx->stage = HOME_STAGE_SLOW_START;
            }

            break;


        case HOME_STAGE_RELEASE_START:

            if ((int32_t)(HAL_GetTick() -
                          ctx->next_move_tick) < 0)
            {
                break;
            }

            /*
             * Home direction is +dir_sign.
             * Release direction is therefore -dir_sign.
             */
            if (Motion_StartHomeRelative(
                    ctx->motion,
                    -ctx->dir_sign * HOME_RELEASE_STEP,
                    HOME_RELEASE_SPEED,
                    HOME_RELEASE_ACCEL,
                    0U))
            {
                ctx->stage =
                    HOME_STAGE_RELEASE_WAIT;
            }

            break;


        case HOME_STAGE_RELEASE_WAIT:

            if (Motion_IsBusy(ctx->motion))
            {
                break;
            }

            result = Motion_GetResult(ctx->motion);

            if (result != MOTION_RESULT_OK)
            {
                ctx->stage = HOME_STAGE_ERROR;
                break;
            }

            /*
             * The release move has finished.
             * Now confirm that the Home sensor remains released.
             */
            ctx->stable_start_tick = HAL_GetTick();

            ctx->stage =
                HOME_STAGE_RELEASE_CONFIRM;

            break;


        case HOME_STAGE_RELEASE_CONFIRM:

            if (!AxisHome_SensorActive(ctx))
            {
                if (ctx->stable_start_tick == 0U)
                {
                    ctx->stable_start_tick =
                        HAL_GetTick();
                }

                if ((HAL_GetTick() -
                     ctx->stable_start_tick) >=
                    HOME_STABLE_CONFIRM_MS)
                {
                    ctx->stage =
                        HOME_STAGE_DONE;
                }
            }
            else
            {
                /*
                 * 2048 counts was not enough to leave the active window.
                 * Retry RELEASE instead of waiting motionless for 180 s.
                 */
                ctx->stable_start_tick = 0U;
                ctx->release_retry_count++;

                if (ctx->release_retry_count >
                    HOME_RELEASE_MAX_RETRIES)
                {
                    ctx->stage = HOME_STAGE_ERROR;
                }
                else
                {
                    ctx->next_move_tick =
                        HAL_GetTick() + HOME_INTER_MOVE_MS;
                    ctx->stage = HOME_STAGE_RELEASE_START;
                }
            }

            break;


        case HOME_STAGE_DONE:
        case HOME_STAGE_ERROR:
        default:
            break;
    }

    return ((ctx->stage == HOME_STAGE_DONE) ||
            (ctx->stage == HOME_STAGE_ERROR)) ? 1U : 0U;
}


void System_Init(
    MotionController_t *motion_x,
    MotionController_t *motion_y)
{
    AxisHome_Init(
        &home_x,
        motion_x,
        X_HomeTriggered,
        X_HOME_DIR_SIGN);

    AxisHome_Init(
        &home_y,
        motion_y,
        Y_HomeTriggered,
        Y_HOME_DIR_SIGN);

    Motion_SetPollingEnabled(home_x.motion, 1U);
    Motion_SetPollingEnabled(home_y.motion, 1U);

    Key0_ResetHold();

    /*
     * Camera trigger idle state: HIGH.
     * Previous standalone hardware test confirmed:
     * PB0 LOW -> optocoupler O1 rises -> camera trigger.
     */
    HAL_GPIO_WritePin(
        CAMERA_TRIG_GPIO_Port,
        CAMERA_TRIG_Pin,
        GPIO_PIN_SET);

    g_key0_start_count = 0U;
    g_camera_ready = 0U;
    g_debug_home_request = 0U;
    g_camera_trigger_request = 0U;
    g_camera_move_request = 0U;
    g_system_error_from_state = SYS_STARTUP;
    g_home_x_stage = home_x.stage;
    g_home_y_stage = home_y.stage;
    g_camera_ready_y_enable = CAMERA_READY_Y_ENABLE_DEFAULT;
    g_camera_ready_x_target = CAMERA_READY_X_DEFAULT;
    g_camera_ready_y_target = CAMERA_READY_Y_DEFAULT;
    g_camera_ready_x_actual = 0;
    g_camera_ready_y_actual = 0;

    g_cal_point_index = 0U;
    g_cal_capture_count = 0U;
    g_cal_sequence_done = 0U;
    g_cal_current_x = CAMERA_READY_X_DEFAULT;
    g_cal_current_y = CAMERA_READY_Y_DEFAULT;
    cal_key_release_required = 0U;
    Cal_LoadPoint(0U);

