jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS_CAL_3X3_SAFE/Core/Src/system_control.c
    system_state = SYS_STARTUP;
    system_state_tick = HAL_GetTick();
     
}


SystemState_t System_GetState(void)
{
    return system_state;
}


uint8_t System_IsCameraReady(void)
{
    return g_camera_ready;
}


void System_Task(void)
{
    /* Always expose current machine positions to Watch / future comm layer. */
    g_camera_ready_x_actual =
        Motion_GetMachinePosition(home_x.motion);

    g_camera_ready_y_actual =
        Motion_GetMachinePosition(home_y.motion);

    g_home_x_stage = home_x.stage;
    g_home_y_stage = home_y.stage;

    switch (system_state)
    {
        case SYS_STARTUP:
        {
            HAL_StatusTypeDef x_status = HAL_OK;
            HAL_StatusTypeDef y_status = HAL_OK;

            g_camera_ready = 0U;

            if (home_x.motion->motor->is_enabled == 0U)
            {
                x_status = MKS_Set_Enable_State(
                    home_x.motion->motor,
                    1U);
            }

            if (home_y.motion->motor->is_enabled == 0U)
            {
                y_status = MKS_Set_Enable_State(
                    home_y.motion->motor,
                    1U);
            }

            if (((x_status != HAL_OK) &&
                 (x_status != HAL_BUSY)) ||
                ((y_status != HAL_OK) &&
                 (y_status != HAL_BUSY)))
            {
                System_EnterError();
                break;
            }

            if ((home_x.motion->motor->is_enabled != 0U) &&
                (home_y.motion->motor->is_enabled != 0U))
            {
                system_state_tick = HAL_GetTick();
                Key0_ResetHold();
                system_state = SYS_WAIT_ENABLE;
                break;
            }

            /*
             * HAL_BUSY is retryable, but startup is never allowed to wait
             * forever on a saturated CAN TX path.
             */
            if ((HAL_GetTick() - system_state_tick) >=
                CONTROL_ENABLE_TX_TIMEOUT_MS)
            {
                System_EnterError();
            }

            break;
        }


        case SYS_WAIT_ENABLE:

            /*
             * The enable frames being queued is not proof that either driver
             * is alive. During the 3 s settle window Motion_Task polls 0x31.
             * At the end, require fresh replies from BOTH axes before allowing
             * Home. A disconnected/unpowered CAN node therefore becomes an
             * explicit SYS_ERROR instead of a later mysterious Home failure.
             */
            if ((HAL_GetTick() - system_state_tick) >=
                CONTROL_ENABLE_SETTLE_MS)
            {
                if ((Motion_PositionIsFresh(home_x.motion) == 0U) ||
                    (Motion_PositionIsFresh(home_y.motion) == 0U))
                {
                    System_EnterError();
                }
                else
                {
                    Key0_ResetHold();
                    system_state = SYS_WAIT_HOME_KEY;
                }
            }
            break;


        case SYS_WAIT_HOME_KEY:

            /*
             * Communication that was healthy at startup must remain healthy.
             * This also prevents the three auto-retransmitting TX mailboxes
             * from staying permanently saturated if the CAN link disappears
             * while the operator is waiting to press KEY0.
             */
            if ((Motion_PositionIsFresh(home_x.motion) == 0U) ||
                (Motion_PositionIsFresh(home_y.motion) == 0U))
            {
                System_EnterError();
                break;
            }

            /*
             * Normal path: one physical KEY0 press held for ~50 ms.
             * Debug escape hatch: set g_debug_home_request=1 in Watch if the
             * laboratory button ever blocks progress.  This is intentionally
             * NOT a second motion owner; it is consumed here by ControlTask.
             */
            if ((g_debug_home_request != 0U) ||
                (Key0_HoldStartRequested() != 0U))
            {
                g_debug_home_request = 0U;
                Key0_ResetHold();

                if (!System_StartHome())
                {
                    System_EnterError();
                }
            }
            break;


        case SYS_HOME_X:

            if (AxisHome_Task(&home_x))
            {
                if (home_x.stage == HOME_STAGE_DONE)
                {
                    /* Y timeout starts only when Y actually begins. */
                    home_y.home_start_tick = HAL_GetTick();
                    system_state = SYS_HOME_Y;
                }
                else
                {
                    System_EnterError();
                }
            }
            break;


        case SYS_HOME_Y:

            if (AxisHome_Task(&home_y))
            {
                if (home_y.stage == HOME_STAGE_DONE)
                {
                    system_state = SYS_HOME_DONE;
                }
                else
                {
                    System_EnterError();
                }
            }
            break;


        case SYS_HOME_DONE:

            /*
             * Home is now infrastructure, not the experiment.
             * Immediately transition to the camera working position.
             */
            system_state = SYS_MOVE_CAMERA_X_START;
            break;


        case SYS_MOVE_CAMERA_X_START:

            if (Camera_TargetAlreadyReached(
                    home_x.motion,
                    g_camera_ready_x_target))
            {
                if (g_camera_ready_y_enable != 0U)
                {
                    system_state = SYS_MOVE_CAMERA_Y_START;
                }
                else
                {
                   System_StartCameraSettle();
                }
            }
            else if (Motion_StartAbsoluteMachine(
                         home_x.motion,
                         g_camera_ready_x_target,
                         CAMERA_READY_SPEED,
                         CAMERA_READY_ACCEL))
            {
                system_state = SYS_MOVE_CAMERA_X_WAIT;
            }
            else
            {
                System_EnterError();
            }
            break;


        case SYS_MOVE_CAMERA_X_WAIT:

            if (!Motion_IsBusy(home_x.motion))
            {
                if (Motion_GetResult(home_x.motion) == MOTION_RESULT_OK)
                {
                    if (!Camera_TargetWithin(
                            home_x.motion,
                            g_camera_ready_x_target,
                            CAMERA_READY_VERIFY_TOLERANCE))
                    {
                        System_EnterError();
                    }
                    else if (g_camera_ready_y_enable != 0U)
                    {
                        system_state = SYS_MOVE_CAMERA_Y_START;
                    }
                    else
                    {
                        System_StartCameraSettle();
                    }
                }
                else
                {
                    System_EnterError();
                }
            }
            break;


        case SYS_MOVE_CAMERA_Y_START:

            if (Camera_TargetAlreadyReached(
                    home_y.motion,
                    g_camera_ready_y_target))
            {
                System_StartCameraSettle();
            }
            else if (Motion_StartAbsoluteMachine(
                         home_y.motion,
                         g_camera_ready_y_target,
                         CAMERA_READY_SPEED,
                         CAMERA_READY_ACCEL))
            {
                system_state = SYS_MOVE_CAMERA_Y_WAIT;
            }
            else
            {
                System_EnterError();
            }
            break;


        case SYS_MOVE_CAMERA_Y_WAIT:

            if (!Motion_IsBusy(home_y.motion))
            {
                if (Motion_GetResult(home_y.motion) == MOTION_RESULT_OK)
                {
                    if (!Camera_TargetWithin(
                            home_y.motion,
                            g_camera_ready_y_target,
                            CAMERA_READY_VERIFY_TOLERANCE))
                    {
                        System_EnterError();
                    }
                    else
                    {
                        System_StartCameraSettle();
                    }
                }
                else
                {
                    System_EnterError();
                }
            }
            break;


        case SYS_CAMERA_SETTLE:

