jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS_CAL_3X3_SAFE/Core/Src/system_control.c
                /*
                 * Allow the stage / target / camera image to settle
                 * before issuing the hardware trigger.
                 */
                if ((HAL_GetTick() - system_state_tick) >=
                    CAMERA_SETTLE_MS)
                {
                    if (Camera_AllTargetsVerified() == 0U)
                    {
                        System_EnterError();
                    }
                    else
                    {
                        system_state = SYS_CAMERA_TRIGGER_START;
                    }
                }

                break;

        case SYS_CAMERA_TRIGGER_START:

            /*
             * Previous standalone hardware test confirmed:
             *
             * PB0 HIGH -> optocoupler output O1 ~= 0 V  (idle)
             * PB0 LOW  -> optocoupler output O1 rises   (camera trigger)
             *
             * MVS is configured for Line0 Rising Edge.
             * Therefore pulling PB0 LOW starts one camera trigger.
             */
            g_camera_ready = 0U;

            HAL_GPIO_WritePin(
                CAMERA_TRIG_GPIO_Port,
                CAMERA_TRIG_Pin,
                GPIO_PIN_RESET);

            system_state_tick = HAL_GetTick();
            system_state = SYS_CAMERA_TRIGGER_WAIT;
            break;


        case SYS_CAMERA_TRIGGER_WAIT:

            /*
             * Non-blocking 10 ms active-low pulse.
             * System_Task is serviced periodically by the existing ControlTask.
             */
            if ((HAL_GetTick() - system_state_tick) >=
                CAMERA_TRIGGER_PULSE_MS)
            {
                HAL_GPIO_WritePin(
                    CAMERA_TRIG_GPIO_Port,
                    CAMERA_TRIG_Pin,
                    GPIO_PIN_SET);

                g_camera_ready = 1U;

                if ((CAL_3X3_ENABLE != 0U) &&
                    (g_cal_capture_count < CAL_3X3_POINT_COUNT))
                {
                    g_cal_capture_count++;

                    if ((g_cal_point_index ==
                         (CAL_3X3_POINT_COUNT - 1U)) &&
                        (g_cal_capture_count >= CAL_3X3_POINT_COUNT))
                    {
                        g_cal_sequence_done = 1U;
                    }
                }

                system_state = SYS_CAMERA_READY;
            }
            break;

        case SYS_CAMERA_READY:

            /*
             * A move request has priority over ready-position verification.
             *
             * Reason: laboratory tuning / future vision control may update
             * g_camera_ready_*_target and g_camera_move_request together.
             * If we compared the current position against the NEW target first,
             * the system would enter SYS_ERROR before it had a chance to move.
             */
            if (g_camera_move_request != 0U)
            {
                g_camera_move_request = 0U;
                g_camera_ready = 0U;
                system_state = SYS_MOVE_CAMERA_X_START;
                break;
            }

            /*
             * Without a move request, CAMERA_READY remains valid only while
             * the current target is in tolerance and encoder feedback is fresh.
             */
            if (Camera_AllTargetsVerified() == 0U)
            {
                System_EnterError();
                break;
            }

            g_camera_ready = 1U;

            /*
             * Formal 3x3 calibration:
             *   P0 is captured automatically at CameraReady after Home.
             *   Each subsequent KEY0 press advances exactly one grid point.
             *   There is no second Home between P0 and P8.
             */
            if ((CAL_3X3_ENABLE != 0U) &&
                (g_cal_sequence_done == 0U) &&
                (Cal_KeyAdvanceRequested() != 0U))
            {
                if (Cal_StartNextPoint() != 0U)
                {
                    break;
                }
            }

            /*
             * Pure camera repeatability test / debug re-trigger.
             * Do not use this during the formal 3x3 run because it would add
             * an extra frame that has no new calibration coordinate.
             */
            if (g_camera_trigger_request != 0U)
            {
                g_camera_trigger_request = 0U;
                g_camera_ready = 0U;
                system_state = SYS_CAMERA_TRIGGER_START;
            }

            break;

        case SYS_ERROR:

            g_camera_ready = 0U;
            /* Terminal error for this boot: no automatic movement. */
            break;


        default:

            g_camera_ready = 0U;
            System_EnterError();
            break;
    }
}
